Operators In SQL

The SQL reserved words and characters are called operators, which are used with a WHERE clause in a SQL query.

Most Used Operators

1. **Arithmetic Operators**: Perform arithmetic operations on numeric values.
   - Example: Addition (+), Subtraction (-), Multiplication (*), Division (/), Modulus (%)

2. **Comparison Operators**: Compare two different data in a SQL table.
   - Example: Equal (=), Not Equal (!=), Greater Than (>), Greater Than Equals to (>=)

3. **Logical Operators**: Perform Boolean operations.
   - Example: ALL, IN, BETWEEN, LIKE, AND, OR, NOT, ANY

4. **Bitwise Operators**: Perform bit operations on Integer values.
   - Example: Bitwise AND (&), Bitwise OR (|)

These operators are crucial for constructing effective SQL queries and performing various operations on your database.

---------------------------------------------------------------------------------------------------------------------------------------------

In [1]:
%pip install jupysql --quiet

Note: you may need to restart the kernel to use updated packages.

In [2]:
%load_ext sql

i. createing Table

In [5]:
%%sql sqlite://
CREATE TABLE emp (
    ID INT PRIMARY KEY,
    Name VARCHAR(50),
    Age INT,
    Salary DECIMAL(10, 2),
    Zip_Code VARCHAR(10)
);


%%sql sqlite:// 
INSERT INTO emp (ID, Name, Age, Salary, Zip_Code)
VALUES
    (4, 'Alice Johnson', 27, 55000.25, '11111'),
    (5, 'Charlie Brown', 40, 70000.00, '22222'),
    (6, 'Eva Williams', 32, 60000.50, '33333'),
    (7, 'David Miller', 45, 80000.75, '44444'),
    (8, 'Grace Davis', 29, 52000.90, '55555'),
    (9, 'Franklin Adams', 38, 72000.60, '66666'),
    (10, 'Helen Turner', 33, 65000.80, '77777'),
    (11, 'George Harris', 28, 54000.45, '88888'),
    (12, 'Ivy Clark', 36, 68000.30, '99999'),
    (13, 'Jackie Wilson', 31, 59000.70, '00000');

++
||
++
++

In [58]:
%%sql sqlite://
CREATE TABLE projects (
    project_id INT PRIMARY KEY,
    project_name VARCHAR(100),
    project_budget INT
);

INSERT INTO projects VALUES
(101, 'Project A', 50000),
(102, 'Project B', 80000),
(103, 'Project C', 100000);

3 rows affected.

++
||
++
++

## i. Airthmectic operation

In [12]:
%%sql sqlite:// 
SELECT Name , age , salary ,
salary + 500 as increase_sal,
salary/12 as Monthly_sal,
salary * 0.1 as Ten_percentage_of_sal
from emp;

+----------------+-----+----------+--------------+-------------------+-----------------------+
|      Name      | Age |  Salary  | increase_sal |    Monthly_sal    | Ten_percentage_of_sal |
+----------------+-----+----------+--------------+-------------------+-----------------------+
| Alice Johnson  |  27 | 55000.25 |   55500.25   | 4583.354166666667 |   5500.025000000001   |
| Charlie Brown  |  40 |  70000   |    70500     |        5833       |         7000.0        |
|  Eva Williams  |  32 | 60000.5  |   60500.5    | 5000.041666666667 |        6000.05        |
|  David Miller  |  45 | 80000.75 |   80500.75   | 6666.729166666667 |   8000.075000000001   |
|  Grace Davis   |  29 | 52000.9  |   52500.9    | 4333.408333333334 |        5200.09        |
| Franklin Adams |  38 | 72000.6  |   72500.6    |      6000.05      |   7200.060000000001   |
|  Helen Turner  |  33 | 65000.8  |   65500.8    | 5416.733333333334 |   6500.080000000001   |
| George Harris  |  28 | 54000.45 |   54500.45   | 4500.037499999999 |        5400.045       |
|   Ivy Clark    |  36 | 68000.3  |   68500.3    | 5666.691666666667 |   6800.030000000001   |
| Jackie Wilson  |  31 | 59000.7  |   59500.7    | 4916.724999999999 |        5900.07        |
+----------------+-----+----------+--------------+-------------------+-----------------------+
Truncated to displaylimit of 10.

## ii. comparison operations with CASE

In [18]:
%%sql sqlite:// 
SELECT ID , Name , Age , Salary ,
CASE 
    WHEN Age = 25 THEN 'Age is 25'
    WHEN Salary > 55000 THEN 'High sal'
    WHEN Salary < 60000 THEN 'LOW sal'
ELSE 'OTHER'
END AS Salary_Categorey
from emp

+----+----------------+-----+----------+------------------+
| ID |      Name      | Age |  Salary  | Salary_Categorey |
+----+----------------+-----+----------+------------------+
| 4  | Alice Johnson  |  27 | 55000.25 |     High sal     |
| 5  | Charlie Brown  |  40 |  70000   |     High sal     |
| 6  |  Eva Williams  |  32 | 60000.5  |     High sal     |
| 7  |  David Miller  |  45 | 80000.75 |     High sal     |
| 8  |  Grace Davis   |  29 | 52000.9  |     LOW sal      |
| 9  | Franklin Adams |  38 | 72000.6  |     High sal     |
| 10 |  Helen Turner  |  33 | 65000.8  |     High sal     |
| 11 | George Harris  |  28 | 54000.45 |     LOW sal      |
| 12 |   Ivy Clark    |  36 | 68000.3  |     High sal     |
| 13 | Jackie Wilson  |  31 | 59000.7  |     High sal     |
+----+----------------+-----+----------+------------------+
Truncated to displaylimit of 10.

## iii.  logical operators:

In [23]:
%%sql sqlite:// 
SELECT Name , age , salary ,
CASE 
    WHEN Age > 30 AND salary > 600000 THEN 'AGE is Greater than 30 and  HIGH salaray'
    WHEN salary < 500000 OR (Age>= 30 AND Age<40) THEN 'salary is low than 500k and age between 30 and 40'
ELSE 'other'
END AS logical_opereator_result
from emp;

+----------------+-----+----------+---------------------------------------------------+
|      Name      | Age |  Salary  |              logical_opereator_result             |
+----------------+-----+----------+---------------------------------------------------+
| Alice Johnson  |  27 | 55000.25 | salary is low than 500k and age between 30 and 40 |
| Charlie Brown  |  40 |  70000   | salary is low than 500k and age between 30 and 40 |
|  Eva Williams  |  32 | 60000.5  | salary is low than 500k and age between 30 and 40 |
|  David Miller  |  45 | 80000.75 | salary is low than 500k and age between 30 and 40 |
|  Grace Davis   |  29 | 52000.9  | salary is low than 500k and age between 30 and 40 |
| Franklin Adams |  38 | 72000.6  | salary is low than 500k and age between 30 and 40 |
|  Helen Turner  |  33 | 65000.8  | salary is low than 500k and age between 30 and 40 |
| George Harris  |  28 | 54000.45 | salary is low than 500k and age between 30 and 40 |
|   Ivy Clark    |  36 | 68000.3  | salary is low than 500k and age between 30 and 40 |
| Jackie Wilson  |  31 | 59000.7  | salary is low than 500k and age between 30 and 40 |
+----------------+-----+----------+---------------------------------------------------+
Truncated to displaylimit of 10.

version 2

1.Like

In [29]:
%%sql sqlite:// 
SELECT * from emp where Name Like '%Davis%';

+----+-------------+-----+---------+----------+
| ID |     Name    | Age |  Salary | Zip_Code |
+----+-------------+-----+---------+----------+
| 8  | Grace Davis |  29 | 52000.9 |  55555   |
+----+-------------+-----+---------+----------+

2.Between

In [31]:
%%sql sqlite://  
SELECT * from emp where Age BETWEEN 28 AND 35;

+----+---------------+-----+----------+----------+
| ID |      Name     | Age |  Salary  | Zip_Code |
+----+---------------+-----+----------+----------+
| 6  |  Eva Williams |  32 | 60000.5  |  33333   |
| 8  |  Grace Davis  |  29 | 52000.9  |  55555   |
| 10 |  Helen Turner |  33 | 65000.8  |  77777   |
| 11 | George Harris |  28 | 54000.45 |  88888   |
| 13 | Jackie Wilson |  31 | 59000.7  |  00000   |
+----+---------------+-----+----------+----------+

3.IN

In [36]:
%%sql sqlite://
SELECT * from emp where Zip_Code IN (77777,33333,55555);

+----+--------------+-----+---------+----------+
| ID |     Name     | Age |  Salary | Zip_Code |
+----+--------------+-----+---------+----------+
| 6  | Eva Williams |  32 | 60000.5 |  33333   |
| 8  | Grace Davis  |  29 | 52000.9 |  55555   |
| 10 | Helen Turner |  33 | 65000.8 |  77777   |
+----+--------------+-----+---------+----------+

4.Not

In [40]:
%%sql sqlite://
SELECT * from emp where AGE NOT IN (29,34);

+----+----------------+-----+----------+----------+
| ID |      Name      | Age |  Salary  | Zip_Code |
+----+----------------+-----+----------+----------+
| 4  | Alice Johnson  |  27 | 55000.25 |  11111   |
| 5  | Charlie Brown  |  40 |  70000   |  22222   |
| 6  |  Eva Williams  |  32 | 60000.5  |  33333   |
| 7  |  David Miller  |  45 | 80000.75 |  44444   |
| 9  | Franklin Adams |  38 | 72000.6  |  66666   |
| 10 |  Helen Turner  |  33 | 65000.8  |  77777   |
| 11 | George Harris  |  28 | 54000.45 |  88888   |
| 12 |   Ivy Clark    |  36 | 68000.3  |  99999   |
| 13 | Jackie Wilson  |  31 | 59000.7  |  00000   |
+----+----------------+-----+----------+----------+

5.All and ANy doesnot support

## iv.Bitwise operators:

In [64]:
'''Not supported'''

'Not supported'

## a.LIMIT Clause

In [68]:
%%sql sqlite://
SELECT * from emp limit 3;

+----+---------------+-----+----------+----------+
| ID |      Name     | Age |  Salary  | Zip_Code |
+----+---------------+-----+----------+----------+
| 4  | Alice Johnson |  27 | 55000.25 |  11111   |
| 5  | Charlie Brown |  40 |  70000   |  22222   |
| 6  |  Eva Williams |  32 | 60000.5  |  33333   |
+----+---------------+-----+----------+----------+

## b.ORDER BY Clause

In [71]:
%%sql sqlite://
SELECT * from emp order by ID ASC;

+----+----------------+-----+----------+----------+
| ID |      Name      | Age |  Salary  | Zip_Code |
+----+----------------+-----+----------+----------+
| 4  | Alice Johnson  |  27 | 55000.25 |  11111   |
| 5  | Charlie Brown  |  40 |  70000   |  22222   |
| 6  |  Eva Williams  |  32 | 60000.5  |  33333   |
| 7  |  David Miller  |  45 | 80000.75 |  44444   |
| 8  |  Grace Davis   |  29 | 52000.9  |  55555   |
| 9  | Franklin Adams |  38 | 72000.6  |  66666   |
| 10 |  Helen Turner  |  33 | 65000.8  |  77777   |
| 11 | George Harris  |  28 | 54000.45 |  88888   |
| 12 |   Ivy Clark    |  36 | 68000.3  |  99999   |
| 13 | Jackie Wilson  |  31 | 59000.7  |  00000   |
+----+----------------+-----+----------+----------+
Truncated to displaylimit of 10.

In [76]:
%%sql sqlite://
SELECT * from emp order by ID DESC LIMIT 5;

+----+----------------+-----+----------+----------+
| ID |      Name      | Age |  Salary  | Zip_Code |
+----+----------------+-----+----------+----------+
| 13 | Jackie Wilson  |  31 | 59000.7  |  00000   |
| 12 |   Ivy Clark    |  36 | 68000.3  |  99999   |
| 11 | George Harris  |  28 | 54000.45 |  88888   |
| 10 |  Helen Turner  |  33 | 65000.8  |  77777   |
| 9  | Franklin Adams |  38 | 72000.6  |  66666   |
+----+----------------+-----+----------+----------+